Revit 2027 API
Opening.Host Property
Retrieves the host element of this opening.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element Host { get; }
Public ReadOnly Property Host As Element
	Get
public:
property Element^ Host {
	Element^ get ();
}
member Host : Element with get
Property Value
Element
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace